{
  "Uuid": "7b588ab8-2ce6-43af-82be-d30244f59e81",
  "PluginType": "organization",
  "Url": "https://www.sec.gov/search-filings",
  "Active": true,
  "GroupName": "Government",
  "Action": "CreateTab",
  "HomePage": "https://www.sec.gov/search-filings",
  "SupportPage": "https://www.sec.gov/",
  "UpdateUrl": null,
  "ExpiresOn": null,
  "Description": "The SEC's EDGAR (Electronic Data Gathering, Analysis, and Retrieval) system is a publicly accessible online database maintained by the U.S. Securities and Exchange Commission (SEC). It serves as a repository for financial filings and disclosures that publicly traded companies, mutual funds, and other entities are required to submit under federal securities laws. Users can access a wealth of information, including annual and quarterly financial reports (Form 10-K and Form 10-Q), insider trading activities (Form 4), IPO filings (Form S-1), and proxy statements (Form DEF 14A). In open-source intelligence (OSINT), EDGAR is a critical tool for conducting due diligence, investigating corporate governance, tracking insider activities, and identifying trends in financial and business strategies. Analysts leverage this data to uncover financial stability, relationships between companies, and even early signs of potential fraud or legal risks. The platform's transparency empowers researchers, investors, and journalists to derive actionable insights from a rich trove of regulatory filings.",
  "Label": "SEC EDGAR",
  "ReadOnly": false,
  "SortOrder": 0,
  "TimeOut": 100,
  "LastAccessedOn": null,
  "CreatedOn": "2025-01-16T00:10:43.647",
  "TimeTaken": 0,
  "DiscoveryToolSiteUuid": null,
  "DiscoveryPluginParentUuid": null,
  "Method": "GET",
  "Version": "1.0.0",
  "MimeTypeRegex": null,
  "Status": null,
  "ContentTypeHeader": null,
  "FieldMapping": {},
  "Headers": {},
  "Regex": null,
  "AuthorizationBearerToken": null,
  "AuthorizationUserName": null,
  "AuthorizationPassword": null,
  "EventType": null,
  "ForwardResponse": false,
  "Script": null,
  "Inputs": null,
  "Outputs": null
}